In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp310-cp310-macosx_11_0_arm64.whl.metadata (89 kB)
Requirement already satisfied: numpy>=1.22.4 in /Users/vaibhavkale/ML Learnings/venv/lib/python3.10/site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/vaibhavkale/ML Learnings/venv/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/vaibhavkale/ML Learnings/venv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp310-cp310-macosx_11_0_arm64.whl (11.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.3/11.3 MB 4.8 MB/s eta 0:00:00a 0:00:01
Downloading pytz-2025.1-py2.py3-none-any.whl (507 kB)
Downloading tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.1 tzdata-2025.1

In [ ]:
## Pandas mainly used for data analysis and data cleaning 
## it mainly works on two types of data structures Series and DataFrames
## Seris is one dimensional array line object, similar to columns
## DataFrame is 2-Dimensional , size-mutable , and potenstially heterogeneous tabular data structure with labled axes(rows and columns).

In [9]:
import pandas as pd

data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
# Create a series from Dictionaries
data = {'a': 1, 'b' : 2, 'c' : 3, 'd' : 4}
dict_series = pd.Series(data)
print(dict_series)

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
data = [1,2,3,4,5]
index = ['a','b','c','d','e']
series = pd.Series(data,index=index)
print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [19]:
import numpy as np
dict = {
    'Name' : ['Vaibhav', 'Suhas', 'Kale'],
    'Age' : [23,50,44],
    'City' : ['Delhi', 'Pune', 'Karmala']
}
dt = pd.DataFrame(dict)
print(dt)
print(type(dt))
print(np.array(dt))

      Name  Age     City
0  Vaibhav   23    Delhi
1    Suhas   50     Pune
2     Kale   44  Karmala
<class 'pandas.core.frame.DataFrame'>
[['Vaibhav' 23 'Delhi']
 ['Suhas' 50 'Pune']
 ['Kale' 44 'Karmala']]

In [37]:
d = [
    {'Name' : 'Vaibhav', 'Age' : 22, 'City' : 'Delhi'},
    {'Name' : 'Suhas', 'Age' : 45, 'City' : 'Karmala'},
    {'Name' : 'Diya', 'Age' : 19, 'City' : 'Vijapur'},
    {'Name' : 'Vandana', 'Age' : 44, 'City' : 'Pune'}
]
tp = pd.DataFrame(d)
print(tp)
print(type(tp))
print(np.array(tp))

      Name  Age     City
0  Vaibhav   22    Delhi
1    Suhas   45  Karmala
2     Diya   19  Vijapur
3  Vandana   44     Pune
<class 'pandas.core.frame.DataFrame'>
[['Vaibhav' 22 'Delhi']
 ['Suhas' 45 'Karmala']
 ['Diya' 19 'Vijapur']
 ['Vandana' 44 'Pune']]

In [38]:
tp

      Name  Age     City
0  Vaibhav   22    Delhi
1    Suhas   45  Karmala
2     Diya   19  Vijapur
3  Vandana   44     Pune

In [39]:
tp['Name']
print(type(tp['Name'])) # Series

<class 'pandas.core.series.Series'>

In [40]:
tp.loc[0] ## with the help of loc operation we can access a particular row

Name    Vaibhav
Age          22
City      Delhi
Name: 0, dtype: object

In [41]:
tp.loc[0][0]

/var/folders/37/lfcwt6tj0fg_c56ytzq6yrv80000gn/T/ipykernel_35130/3022827700.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  tp.loc[0][0]

'Vaibhav'

In [42]:
tp.iloc[0][0]

/var/folders/37/lfcwt6tj0fg_c56ytzq6yrv80000gn/T/ipykernel_35130/3956806005.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  tp.iloc[0][0]

'Vaibhav'

In [43]:
# Accessing a Specified Element
print(tp.at[1,'Age'])

45

In [44]:
tp

      Name  Age     City
0  Vaibhav   22    Delhi
1    Suhas   45  Karmala
2     Diya   19  Vijapur
3  Vandana   44     Pune

In [45]:
# Accessing a Specified Element using iat
print(tp.iat[1,1])

45

In [ ]:
## Data Manipulation using DataFrames
## Adding a Column
tp['Salary'] = [100,200,300,400]

In [48]:
tp

      Name  Age     City  Salary
0  Vaibhav   22    Delhi     100
1    Suhas   45  Karmala     200
2     Diya   19  Vijapur     300
3  Vandana   44     Pune     400

In [50]:
## tp.drop('Salary')  this will give error bcz by default it will search in rows 
tp.drop('Salary', axis = 1) ## this will only drop Salary Column temporary
## to drop the Salary column permanantly
tp.drop('Salary', axis = 1, inplace=True)

In [51]:
tp

      Name  Age     City
0  Vaibhav   22    Delhi
1    Suhas   45  Karmala
2     Diya   19  Vijapur
3  Vandana   44     Pune

In [52]:
tp['Age'] += 1

In [53]:
tp

      Name  Age     City
0  Vaibhav   23    Delhi
1    Suhas   46  Karmala
2     Diya   20  Vijapur
3  Vandana   45     Pune

In [54]:
tp.drop(0)

      Name  Age     City
1    Suhas   46  Karmala
2     Diya   20  Vijapur
3  Vandana   45     Pune

In [55]:
tp

      Name  Age     City
0  Vaibhav   23    Delhi
1    Suhas   46  Karmala
2     Diya   20  Vijapur
3  Vandana   45     Pune

In [59]:
tp.tail(1)

      Name  Age  City
3  Vandana   45  Pune

In [57]:
tp

      Name  Age     City
0  Vaibhav   23    Delhi
1    Suhas   46  Karmala
2     Diya   20  Vijapur
3  Vandana   45     Pune

In [60]:
tp.head(2)

      Name  Age     City
0  Vaibhav   23    Delhi
1    Suhas   46  Karmala

In [61]:
tp.describe()

             Age
count   4.000000
mean   33.500000
std    13.916417
min    20.000000
25%    22.250000
50%    34.000000
75%    45.250000
max    46.000000